СистемаЛиквидацииАкадемическихЗадолженностейСтудентов/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</name>
  <registerRecords>AccumulationRegister.НагрузкаКомиссий</registerRecords>
  <registerRecords>AccumulationRegister.НеявкиНаПересдачи</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныеГода</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>CatalogRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ПреподавательКомиссии</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>РольВКомиссии</name>
    <type>
      <types>EnumRef.РольВКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаседаний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НазначениеСтудентаДляПреподавателя</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВида</name>
      <type>
        <types>EnumRef.НаименованиеВида</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПропусков</name>
      <type>
        <types>EnumRef.КоличествоПропусков</types>
      </type>
    </attributes>
    <attributes>
      <name>ПотерянныеЧасыПреподавателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностейСтудентов/src/Enums/КоличествоПропусков/КоличествоПропусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КоличествоПропусков</name>
  <enumValues>
    <name>Ноль</name>
  </enumValues>
  <enumValues>
    <name>Один</name>
  </enumValues>
  <enumValues>
    <name>Два</name>
  </enumValues>
</mdclass:Enum>

СистемаЛиквидацииАкадемическихЗадолженностейСтудентов/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзмененииНаСервере(Значение)
	Если Значение = Перечисления.КоличествоПропусков.Ноль Тогда
		Возврат "-";
	ИначеЕсли Значение = Перечисления.КоличествоПропусков.Один Тогда
		Возврат 2;
	ИначеЕсли Значение = Перечисления.КоличествоПропусков.Два Тогда
		Возврат 4;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзменении(Элемент)  
	ТЧ = Элементы.НазначениеСтудентаДляПреподавателя.ТекущиеДанные;
	Значение = ТЧ.КоличествоПропусков;
	ТЧ.ПотерянныеЧасыПреподавателя = НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзмененииНаСервере(Значение);
КонецПроцедуры
